Catalogs/УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлектроннойПочты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверИсходящейПочтыSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортIMAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPАутентификация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыSMTPАутентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОставлятьКопииСообщенийНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодХраненияСообщенийНаСервере</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПолучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйРазмерПисьма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверВходящейПочтыIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЗащищеннаяАутентификацияIMAP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УчетныеЗаписиЭлектроннойПочты/Forms/ДополнительныеСвойстваУчетнойЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Ссылка = Параметры.Ссылка;
	
	Заполнить_СписокSMTPАутентификация_СП();
	
	УчетнаяЗаписьСтруктура = Параметры.УчетнаяЗаписьСтруктура;
	
	ДлительностьОжиданияСервера = УчетнаяЗаписьСтруктура.ВремяОжидания;
	
	МаксимальныйРазмерПисьма = УчетнаяЗаписьСтруктура.МаксимальныйРазмерПисьма;	
	
	ОставлятьКопииСообщенийНаСервере = УчетнаяЗаписьСтруктура.ОставлятьКопииСообщенийНаСервере;
	ОставлятьКопииСообщенийЧислоДней = УчетнаяЗаписьСтруктура.ПериодХраненияСообщенийНаСервере;
	УдалятьСообщенияССервера		 = ?(ОставлятьКопииСообщенийЧислоДней = 0, Ложь, Истина);
	
	ПортSMTP = УчетнаяЗаписьСтруктура.ПортSMTP;
	ПортIMAP = УчетнаяЗаписьСтруктура.ПортIMAP;
	
	ПользовательSMTP         = УчетнаяЗаписьСтруктура.ПользовательSMTP;
	ПарольSMTP               = УчетнаяЗаписьСтруктура.ПарольSMTP;
	
	SMTPАутентификация = УчетнаяЗаписьСтруктура.SMTPАутентификация;
	
	SMTPАутентификацияУстановлена = ?(SMTPАутентификация = Перечисления.ВариантыSMTPАутентификации.НеЗадано, Ложь, Истина);
	
	Элементы.ГруппаАутентификацияSMTP.ТекущаяСтраница = ?(SMTPАутентификация = Перечисления.ВариантыSMTPАутентификации.ЗадаетсяПараметрами,
															Элементы.ГруппаПараметры,
															Элементы.ГруппаПустаяСтраница);
	ТолькоЗащищеннаяАутентификацияIMAP = УчетнаяЗаписьСтруктура.ТолькоЗащищеннаяАутентификацияIMAP;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементовФормы();
	
	ОбновитьПодсказкуМаксимальногоРазмераПисьма();	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события "при изменении" элемента формы "SMTPАутентификация".
// Вызывает процедуру обновления группы дополнительных параметров
// аутентификации.
//
&НаКлиенте
Процедура SMTPАутентификацияПриИзменении(Элемент)
	
	УстановитьДополнительныеПараметрыПоSMTPАутентификации();
	
КонецПроцедуры

// Обработчик события "при изменении" элемента формы "ТребуетсяДополнительнаяSMTPАутентификация".
// Устанавливает параметры аутентификации "по умолчанию", а так же
// снимает их при снятии флага необходимости дополнительной SMTP аутентификации.
//
&НаКлиенте
Процедура SMTPАутентификацияУстановленаПриИзменении(Элемент)
	
	Если SMTPАутентификацияУстановлена Тогда
		Элементы.SMTPАутентификация.Доступность = Истина;
		SMTPАутентификация = SMTPАутентификация_АналогичноIMAP();
	Иначе
		Элементы.SMTPАутентификация.Доступность = Ложь;
		SMTPАутентификация = SMTPАутентификация_НеЗадано();
	КонецЕсли;
	
	УстановитьДополнительныеПараметрыПоSMTPАутентификации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОставлятьКопииСообщенийНаСервереПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьСообщенияССервераПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовФормы();
	
	Если УдалятьСообщенияССервера Тогда
		ОставлятьКопииСообщенийЧислоДней = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныйРазмерПисьмаПриИзменении(Элемент)

	ОбновитьПодсказкуМаксимальногоРазмераПисьма();	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УстановитьПортыПоУмолчаниюВыполнить()
	
	ПортSMTP = 25;
	ПортIMAP = 993;
	
КонецПроцедуры

// Выполняет проверку корректности значений реквизитов формы и возвращает
// управление в вызывающую среду с дополнительными заполненными параметрами
// учетной записи.
// 
&НаКлиенте
Процедура ЗаполнитьДопПараметрыИВернутьсяВыполнить()
	
	Если SMTPАутентификацияУстановлена
	   И SMTPАутентификация <> SMTPАутентификация_АналогичноIMAP()
	   И SMTPАутентификация <> SMTPАутентификация_ЗадаетсяПараметрами()
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать способ SMTP аутентификации'"),, "SMTPАутентификация");
		Возврат;
	КонецЕсли;
	
	Оповестить("УстановкаДополнительныхПараметровУчетнойЗаписи", ЗаполнитьДополнительныеПараметры(), Ссылка);
	
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Единая процедура для установки доступности элементов формы в зависимости от условий
//
&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ОставлятьКопииСообщенийНаСервере Тогда
		Элементы.УдалятьСообщенияССервера.Доступность = Истина;
		Если УдалятьСообщенияССервера Тогда
			Элементы.ОставлятьКопииСообщенийЧислоДней.Доступность = Истина;
		Иначе
			Элементы.ОставлятьКопииСообщенийЧислоДней.Доступность = Ложь;
		КонецЕсли;
	Иначе
		Элементы.УдалятьСообщенияССервера.Доступность = Ложь;
		Элементы.ОставлятьКопииСообщенийЧислоДней.Доступность = Ложь;
	КонецЕсли;
	
	Если SMTPАутентификацияУстановлена Тогда
		Элементы.SMTPАутентификация.Доступность = Истина;
	Иначе
		Элементы.SMTPАутентификация.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Функция, формирующая параметры настроек перед передачей их в вызывающую среду.
//
// Возвращаемое значение:
// структура
// ключ "ПортSMTP", значение - число, порт SMTP
// ключ "ОставлятьКопииСообщенийНаСервере" - булево - признак того, что необходимо оставлять на сервере сообщения
// ключ "ПериодХраненияСообщенийНаСервере" - число - число дней, которое сообщение должно храниться на сервере
// ключ "ДлительностьОжиданияСервера", значение - число секунд ожидания успешного выполнения операции на сервере
// ключ "SMTPАутентификация", Перечисление.SMTPАутентификация
// ключ "ПользовательSMTP", значение - строка, имя пользователя SMTP аутентификации
// ключ "ПарольSMTP", значение - строка, пароль SMTP аутентификации
//
// *- при аутентификации "АналогичноIMAP" тип аутентификации не устанавливается,
//    тем не менее происходит его копирование
//
// Все поля, при любых параметрах аутентификации заполняются. Таким образом в вызывающей
// среде остается только взять их как есть без дополнительной обработки.
//
&НаКлиенте
Функция ЗаполнитьДополнительныеПараметры()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПортSMTP", ПортSMTP);
	Результат.Вставить("ПортIMAP", ПортIMAP);
	
	Результат.Вставить("ОставлятьКопииСообщенийНаСервере", ОставлятьКопииСообщенийНаСервере);
	
	Если УдалятьСообщенияССервера Тогда
		ОставлятьКопииСообщенийЧислоДней = ОставлятьКопииСообщенийЧислоДней;
	Иначе
		ОставлятьКопииСообщенийЧислоДней = 0;
	КонецЕсли;
	
	Результат.Вставить("ПериодХраненияСообщенийНаСервере", ОставлятьКопииСообщенийЧислоДней);
	
	Результат.Вставить("ДлительностьОжиданияСервера", ДлительностьОжиданияСервера);
	
	Если SMTPАутентификацияУстановлена Тогда
		Результат.Вставить("SMTPАутентификация", SMTPАутентификация);
		Если SMTPАутентификация = (SMTPАутентификация_ЗадаетсяПараметрами()) Тогда
			Результат.Вставить("ПользовательSMTP", ПользовательSMTP);
			Результат.Вставить("ПарольSMTP", ПарольSMTP);
		Иначе
			Результат.Вставить("ПользовательSMTP", "");
			Результат.Вставить("ПарольSMTP", "");
		КонецЕсли;
	Иначе
		Результат.Вставить("SMTPАутентификация", SMTPАутентификация_НеЗадано());
		Результат.Вставить("ПользовательSMTP", "");
		Результат.Вставить("ПарольSMTP", "");
	КонецЕсли;
	
	Результат.Вставить("МаксимальныйРазмерПисьма", МаксимальныйРазмерПисьма);
	
	Результат.Вставить("ТолькоЗащищеннаяАутентификацияIMAP", ТолькоЗащищеннаяАутентификацияIMAP);
	
	Возврат Результат;
	
КонецФункции

// Процедура устанавливает видимость парметров аутентификации
// для выбора способа аутентификации "ЗаданыПараметры".
//
&НаКлиенте
Процедура УстановитьДополнительныеПараметрыПоSMTPАутентификации()
	
	Элементы.ГруппаАутентификацияSMTP.ТекущаяСтраница =
	                  ?(SMTPАутентификация = SMTPАутентификация_ЗадаетсяПараметрами(),
	                   Элементы.ГруппаПараметры,
	                   Элементы.ГруппаПустаяСтраница);
	
КонецПроцедуры

&НаСервере
Функция Заполнить_СписокSMTPАутентификация_СП()
	
	СписокSMTPАутентификация_СП.Добавить(Перечисления.ВариантыSMTPАутентификации.АналогичноIMAP,
	                                     "АналогичноIMAP");
	СписокSMTPАутентификация_СП.Добавить(Перечисления.ВариантыSMTPАутентификации.ЗадаетсяПараметрами,
	                                     "ЗадаетсяПараметрами");
	СписокSMTPАутентификация_СП.Добавить(Перечисления.ВариантыSMTPАутентификации.НеЗадано,
	                                     "НеЗадано");
	
КонецФункции

&НаКлиенте
Функция SMTPАутентификация_АналогичноIMAP()
	
	Возврат СписокSMTPАутентификация_СП[0].Значение;
	
КонецФункции

&НаКлиенте
Функция SMTPАутентификация_ЗадаетсяПараметрами()
	
	Возврат СписокSMTPАутентификация_СП[1].Значение;
	
КонецФункции

&НаКлиенте
Функция SMTPАутентификация_НеЗадано()
	
	Возврат СписокSMTPАутентификация_СП[2].Значение;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПодсказкуМаксимальногоРазмераПисьма()
	
	Элементы.НадписьБайт.Подсказка = Формат(МаксимальныйРазмерПисьма / (1024 * 1024), "ЧДЦ=2; ЧС=; ЧФ=' ~ Ч МБ'");
	
КонецПроцедуры
